app/controllers/api/v1/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "susan@me.com"], ["LIMIT", 1]]
---
    def login
      # check if my params contain the entered email and password
      user = User.find_by(email: params[:email])