app/controllers/api/v1/bookings_controller.rb

    def create
        @booking = Booking.create(booking_params)
---
INSERT INTO "bookings" ("user_id", "listing_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 15], ["listing_id", 93], ["created_at", "2019-07-16 15:20:03.609649"], ["updated_at", "2019-07-16 15:20:03.609649"]]

    def destroy
      @booking.destroy
---
DELETE FROM "bookings" WHERE "bookings"."id" = $1  [["id", 111]]

    def get_booking
      @booking = Booking.find(params[:id])
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 111], ["LIMIT", 1]]