app/controllers/api/v1/listings_controller.rb

INSERT INTO "listings" ("neighborhood", "borough", "price", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
      @listing = @user.listings.create(listing_params)

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def get_listing
      @listing = Listing.find(params[:id])