app/controllers/api/v1/users_controller.rb

	def create
		user = User.new(
      first_name: params[:first_name],
      last_name: params[:last_name],
			email: params[:email],
			password: params[:password],
		)
		if user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def get_user
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]